// app/data/changelog.js

export const changelog = [
    {
      date: "2025-12-03",
      title: "Connect to DB",
      items: ["Підключили БД NEON", "Динамічна зміна часу"],
    },
    {
      date: "2025-11-11",
      title: "Countdown Banner Customization",
      items: [
        "Додано кастомний банер з таймером (Countdown Timer)",
        "Реалізовано кольорову кастомайзцію у кастомайзері (фон, текст, цифри, радіус, вирівнювання)",
        "Підтримка унікальних стилів для кількох блоків одночасно",
        "Підготовлено структуру для наступного етапу — вибір дати завершення",
      ],
    },
    {
      date: "2025-11-03",
      title: "Release Alpha Version",
      items: ["Запуск апки в стор", "Активація в кастомайзі"],
    },
    {
      date: "2025-11-02",
      title: "Settings: ON/OFF",
      items: ["Додано тумблер увімкн./вимкн. віджета", "Збереження у Prisma"],
    },
    {
      date: "2025-11-01",
      title: "Початковий шаблон",
      items: [
        "Генерація продуктів через Admin GraphQL",
        "Початкова структура апки",
      ],
    },
  ];
  